Repository: quannh287/ErgoApp
Catalog: iosApp/iosApp/*.lproj/Localizable.strings
Languages: vi

# mode_side
source: Side
vi: Nghiêng

# mode_front
source: Front
vi: Trực diện

# timer_off
source: Off
vi: Tắt

# onboard_skip
source: Skip
vi: Bỏ qua

# onboard_next
source: Next
vi: Tiếp tục

# onboard_start
source: Start
vi: Bắt đầu

# onboard_back
source: Back
vi: Quay lại

# onboard_1_title
source: Capture Side View
vi: Chụp ảnh góc nghiêng

# onboard_1_desc
source: Place phone steadily or ask someone to take a photo from the side. Ensure ear and shoulder are visible.
vi: Đặt điện thoại cố định hoặc nhờ người khác chụp ảnh bạn từ bên hông. Đảm bảo thấy rõ tai và vai.

# onboard_2_title
source: View Analysis Results
vi: Xem kết quả phân tích

# onboard_2_desc
source: AI will calculate head protrusion and neck load in kg.
vi: AI sẽ tính toán độ nhô đầu và cho bạn biết cổ đang gánh bao nhiêu kg áp lực.

# onboard_3_title
source: 30-Second Exercise
vi: Làm bài tập 30 giây

# onboard_3_desc
source: Follow Chin Tuck exercise guide, retake photo and see improvement!
vi: Thực hiện bài tập Chin Tuck theo hướng dẫn, chụp lại và thấy ngay sự cải thiện!

# guide_side
source: Stand sideways Ensure ear and shoulder are visible
vi: Đứng nghiêng Đảm bảo thấy rõ tai và vai

# guide_front
source: Stand facing camera Ensure both shoulders are visible
vi: Đứng đối diện Đảm bảo thấy rõ cả 2 vai

# result_safe
source: Normal
vi: An toàn

# result_warning
source: Warning
vi: Quá tải nhẹ

# result_danger
source: Danger
vi: Quá tải nghiêm trọng

# neck_load_title
source: Neck Load
vi: Áp lực lên cổ

# exercise_title
source: 30s Exercise
vi: Bài tập 30 giây

# btn_retake
source: Retake
vi: Chụp lại

# btn_compare
source: Compare
vi: So sánh tiếp

# btn_reset
source: Reset
vi: Làm lại từ đầu

# history_title
source: History
vi: Lịch sử phân tích

# history_empty_title
source: No History
vi: Chưa có lịch sử

# history_empty_desc
source: Take a photo to start analysis
vi: Chụp ảnh để bắt đầu phân tích tư thế

# pressure_label
source: Load: ~%d kg
vi: Áp lực: ~%d kg

# perm_title
source: Camera Permission Needed
vi: Cần quyền Camera

# perm_desc
source: App needs camera access to analyze posture
vi: Để phân tích tư thế, ứng dụng cần quyền truy cập camera

# perm_btn
source: Grant Permission
vi: Cấp quyền

# analysis_good
source: Good posture! Keep it up.
vi: Tư thế tốt! Tiếp tục duy trì như vậy.

# analysis_warning
source: Neck muscles are bearing double the head weight.
vi: Cơ cổ đang phải gánh gấp đôi trọng lượng đầu.

# analysis_danger
source: Severe neck load! Adjust posture immediately.
vi: Áp lực cổ nghiêm trọng! Cần điều chỉnh tư thế ngay.

# fix_action
source: Do Chin Tuck: Keep head straight, gently push chin back with fingers. Hold 10s, repeat 3 times.
vi: Thực hiện bài tập Chin Tuck: Giữ đầu thẳng, dùng ngón tay đẩy nhẹ cằm về phía sau. Giữ 10 giây, lặp lại 3 lần.

# compare_improved
source: Great! You improved %d%% from last time!
vi: Tuyệt vời! Bạn đã cải thiện %d%% so với lần trước!

# compare_worsened
source: Warning: Your posture worsened by %d%%.
vi: Cảnh báo: Tư thế của bạn tệ hơn %d%% so với lần trước.
